HengeLiu/RealtimeAgent/examples/device_app_demo/esp32-s3/firmware/sdkconfig.defaults
# G21 FPC bring-up defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# Keep optimization conservative during board bring-up
CONFIG_COMPILER_OPTIMIZATION_DEBUG=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
# The G21/ESP32-S3 board reports embedded 8MB PSRAM at boot. Camera frame
# buffers must use external RAM; otherwise visual capture fails under audio load.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
